001/memo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1951d0c">No.1</a></li>
<li><a href="#org189dcc4">No.2</a></li>
<li><a href="#org79313e2">No.3</a></li>
<li><a href="#org2d1dede">No.4</a></li>
<li><a href="#orgd6b59fe">No.5</a></li>
<li><a href="#org8a0e243">No.6</a></li>
<li><a href="#org1ab85d1">No.7</a></li>
<li><a href="#org6ed5dc0">No.8</a></li>
<li><a href="#org5d806d8">No.9</a></li>
<li><a href="#orgefd104d">No.11</a></li>
<li><a href="#orgf9d3237">No.12</a></li>
<li><a href="#org95e4761">No.13</a></li>
<li><a href="#org28cf1ed">No.16</a></li>
<li><a href="#org4618c4d">No.17</a></li>
<li><a href="#org155df5d">No.18</a></li>
<li><a href="#orgc670e38">No.20</a></li>
<li><a href="#org83be551">No.21</a></li>
<li><a href="#orgc428781">No.22</a></li>
<li><a href="#org5ae19b2">No.23</a></li>
<li><a href="#org1334d70">No.24</a></li>
<li><a href="#org67f74ec">No.25</a></li>
<li><a href="#orgcd73f23">No.26</a></li>
<li><a href="#orgdea6abb">No.27</a></li>
<li><a href="#org22db76d">No.29</a></li>
<li><a href="#org29a860c">No.30</a></li>
<li><a href="#orgd74ac6f">No.32</a></li>
<li><a href="#orgf617c96">No.33</a></li>
<li><a href="#orga0f5829">No.34</a></li>
<li><a href="#org81defde">No.35</a></li>
<li><a href="#org7c0d990">No.36</a></li>
<li><a href="#orgc9762fa">No.37</a></li>
<li><a href="#orgf5e73b1">No.38</a></li>
<li><a href="#org83ac7ee">No.39</a></li>
<li><a href="#orgaf3ea5a">No.40</a></li>
<li><a href="#org5a85a69">No.41</a></li>
<li><a href="#org5ed066b">No.43</a></li>
<li><a href="#org5bfc2d4">No.44</a></li>
<li><a href="#orgfa55052">No.45</a></li>
<li><a href="#orga101863">No.46</a></li>
<li><a href="#orgff2f11b">No.47</a></li>
<li><a href="#org505f67e">No.48</a></li>
<li><a href="#orge5277e4">No.49</a></li>
<li><a href="#orge359610">No.50</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1951d0c" class="outline-2">
<h2 id="org1951d0c">No.1</h2>
<div class="outline-text-2" id="text-org1951d0c">
<p>
\(i\) 番目の町にコスト \(c\) で到達したときの到達時間を \(T\) として、\(i\) 番目の町から \(j\) 番目の町にたどり着くためのコストと時間を \(C_{ij}\), \(M_{ij}\) とすると、
</p>

<p>
\[ T(j, c + C_{ij}) = min(T(i, c) + M_{ij}) \]
</p>

<p>
となる。ただし、\(i\) は \(j\) へつながっている町すべてをたどる。これを DP で計算し、\(T(N, \ast)\) の最小値を求める。
</p>
</div>
</div>

<div id="outline-container-org189dcc4" class="outline-2">
<h2 id="org189dcc4">No.2</h2>
<div class="outline-text-2" id="text-org189dcc4">
<p>
素因数分解したときの各素因数の累乗数を使った Nim である。
</p>
</div>
</div>

<div id="outline-container-org79313e2" class="outline-2">
<h2 id="org79313e2">No.3</h2>
<div class="outline-text-2" id="text-org79313e2">
<p>
訪れた数字をメモしておいて、訪れていない数字を幅優先探索で辿っていく。
</p>
</div>
</div>

<div id="outline-container-org2d1dede" class="outline-2">
<h2 id="org2d1dede">No.4</h2>
<div class="outline-text-2" id="text-org2d1dede">
<p>
すべてのおもりの重さの合計の半分の重さを作れるかどうかを調べる。
</p>

<p>
\(i\) 番目のおもりまで調べたときにおもりの重さの合計 \(W\) を作れるかどうかを \(B(i, W)\) とすると、
</p>

<p>
\[ B(i, W) = B(i - 1, W) \land B(i - 1, W + W_i) \]
</p>

<p>
となる。これを DP で計算し、\(B(N, \sum W_i/2)\) を見る。
</p>
</div>
</div>

<div id="outline-container-orgd6b59fe" class="outline-2">
<h2 id="orgd6b59fe">No.5</h2>
<div class="outline-text-2" id="text-orgd6b59fe">
<p>
ブロックを昇順にソートし、貪欲法で箱に入れていく。
</p>
</div>
</div>

<div id="outline-container-org8a0e243" class="outline-2">
<h2 id="org8a0e243">No.6</h2>
<div class="outline-text-2" id="text-org8a0e243">
<p>
素数列とハッシュ列はあらかじめ求めておく。
しゃくとり法で最大の長さを探す。
</p>
</div>
</div>

<div id="outline-container-org1ab85d1" class="outline-2">
<h2 id="org1ab85d1">No.7</h2>
<div class="outline-text-2" id="text-org1ab85d1">
<p>
各数字のgrundy数を順に計算していく。
</p>
</div>
</div>

<div id="outline-container-org6ed5dc0" class="outline-2">
<h2 id="org6ed5dc0">No.8</h2>
<div class="outline-text-2" id="text-org6ed5dc0">
<p>
\(N \equiv 1 \pmod{K+1}\) を相手に渡せれば勝てる。したがって、\(N\) がすでにその数字であれば負け、そうでなければ勝ちである。
</p>
</div>
</div>

<div id="outline-container-org5d806d8" class="outline-2">
<h2 id="org5d806d8">No.9</h2>
<div class="outline-text-2" id="text-org5d806d8">
<p>
自分のモンスターを優先順位付きキューに入れておいてレベルが低い順に取り出せるようにする。
</p>

<p>
どの敵モンスターから戦うかを全探索して最小の最多戦闘回数を求める。
</p>
</div>
</div>

<div id="outline-container-orgefd104d" class="outline-2">
<h2 id="orgefd104d">No.11</h2>
<div class="outline-text-2" id="text-orgefd104d">
<p>
マークの種類 &times; 数字の表を作り手札を埋めると、マッチするカードは埋められた手札と同じ行/列のマスである。
</p>

<p>
マッチするマスが上/左にくるように行/列の入れ替えを行うと、マッチするカードの枚数は面積で求められる。
</p>
</div>
</div>

<div id="outline-container-orgf9d3237" class="outline-2">
<h2 id="orgf9d3237">No.12</h2>
<div class="outline-text-2" id="text-orgf9d3237">
<p>
素数列をあらかじめ求めておく。
</p>

<p>
素数列を走査して使ってもいい数字だけを使っている部分列をなるべく長くなるように抜き出し、その部分列が
使ってもいい数字をすべて使っているなら、その素数列の前後の素数の差-2を保存しておく。
</p>

<p>
保存された素数の差の最大値が答えである。
</p>
</div>
</div>

<div id="outline-container-org95e4761" class="outline-2">
<h2 id="org95e4761">No.13</h2>
<div class="outline-text-2" id="text-org95e4761">
<p>
未訪問のマスから始めて同じ数字を持つマスを深さ優先探索(幅優先探索)で辿っていき、直前に辿ったマス以外で訪問済のマスに辿りついた場合は囲みができているということである。
</p>

<p>
これを未訪問のマスがなくなるまで続ける。
</p>
</div>
</div>

<div id="outline-container-org28cf1ed" class="outline-2">
<h2 id="org28cf1ed">No.16</h2>
<div class="outline-text-2" id="text-org28cf1ed">
<p>
\(x^{2^n}\) をあらかじめ計算しておく。\(a_k\) を \(2^m\) の和に分解(2進数に変換して立っているビットを取得)して、計算しておいた \(x^{2^n}\) を足していく。
</p>
</div>
</div>

<div id="outline-container-org4618c4d" class="outline-2">
<h2 id="org4618c4d">No.17</h2>
<div class="outline-text-2" id="text-org4618c4d">
<p>
すべての地点間の距離をワーシャル・フロイド法で求めておく。
</p>

<p>
1番目に滞在する地点と2番目に滞在する地点で全探索する。
</p>
</div>
</div>

<div id="outline-container-org155df5d" class="outline-2">
<h2 id="org155df5d">No.18</h2>
<div class="outline-text-2" id="text-org155df5d">
<p>
実装あるのみ。
</p>
</div>
</div>

<div id="outline-container-orgc670e38" class="outline-2">
<h2 id="orgc670e38">No.20</h2>
<div class="outline-text-2" id="text-orgc670e38">
<p>
まずスタートからゴールまで直接行けるかどうかを調べる。行けない場合、オアシスを経由して行けるかどうかを調べる。
</p>

<p>
2地点間の体力の消費量はダイクストラ法で求める。
</p>
</div>
</div>

<div id="outline-container-org83be551" class="outline-2">
<h2 id="org83be551">No.21</h2>
<div class="outline-text-2" id="text-org83be551">
<p>
{最大値}, {最小値}, {残り} とグループ分けしたときが最も平均の差が大きくなる。すなわち最大値と最小値の差を計算すればいい。
</p>
</div>
</div>

<div id="outline-container-orgc428781" class="outline-2">
<h2 id="orgc428781">No.22</h2>
<div class="outline-text-2" id="text-orgc428781">
<p>
\(k\) 文字目が <code>'('</code> ならば、\(k\) 文字目から順番に走査していき、 <code>'('</code> なら \(+1\) 、 <code>')'</code> なら \(-1\) を累計していく。累計が \(0\) に戻ったときの文字が対応するカッコである。
</p>

<p>
\(k\) 文字目が <code>')'</code> ならば、K文字目から逆順に走査する。
</p>
</div>
</div>

<div id="outline-container-org5ae19b2" class="outline-2">
<h2 id="org5ae19b2">No.23</h2>
<div class="outline-text-2" id="text-org5ae19b2">
<p>
合計 \(N\) のダメージを与えるのに必要な攻撃回数の期待値を \(E(N)\) とすると、
</p>

<p>
\[ E(N) = \min(E(N - A) + 1, E(N - D) + 3/2) \]
</p>

<p>
となる。ただし \(n \leq 0\) のとき \(E(n) = 0\) である。これを DP で計算し、\(E(N)\) を見る。
</p>
</div>
</div>

<div id="outline-container-org1334d70" class="outline-2">
<h2 id="org1334d70">No.24</h2>
<div class="outline-text-2" id="text-org1334d70">
<p>
\(0 \dots 9\) からなる候補配列を用意しておき、二郎君の答えが 'YES' ならば提示した数字と候補配列の AND をとり、二郎君の答えが 'NO' ならば候補配列から提示した数字を取り除く。
</p>

<p>
残った数字が答えである。
</p>
</div>
</div>

<div id="outline-container-org67f74ec" class="outline-2">
<h2 id="org67f74ec">No.25</h2>
<div class="outline-text-2" id="text-org67f74ec">
<p>
\(N,M\) は約分しておく。
</p>

<p>
\(N\) が \(M\) で割り切れるなら \(0\) 以外の一番下の桁が答えである。
</p>

<p>
\(N\) が \(M\) で割り切れない場合、\(M\) の素因数に \(2,5\) 以外が含まれていれば無限小数である。
</p>

<p>
\(M\) の素因数に \(2,5\) のみが含まれている場合、\(M\) が \(10^n\) になるように \(N,M\) に \(2^m,5^l\) をかけて、そのときの \(N\) の \(0\) 以外の一番下の桁が答えとなる。
</p>
</div>
</div>

<div id="outline-container-orgcd73f23" class="outline-2">
<h2 id="orgcd73f23">No.26</h2>
<div class="outline-text-2" id="text-orgcd73f23">
<p>
実装あるのみ。
</p>
</div>
</div>

<div id="outline-container-orgdea6abb" class="outline-2">
<h2 id="orgdea6abb">No.27</h2>
<div class="outline-text-2" id="text-orgdea6abb">
<p>
長さ \(a_i \; (i=1,2,3)\) の板から長さ \(V\) の板を作るための最小枚数を求める方法は次の通りである。
</p>

<p>
\(i\) 番目の板までを使ったときに長さ \(L\) の板を作るための最小枚数を \(N(L)\) とすると、
</p>

<p>
\[ N(i, L) = min(N(i - 1, L), N(i - 1, L - ka_i) + k) \]
</p>

<p>
となる。ただし、\(k\) は \(L-ka_i\) が \(0\) 以上となる範囲をたどる。これを DP で計算し、\(N(3, V)\) を見る。
</p>

<p>
あとは \(A,B,C\) を \(1 \dots 30\) まで全探索(ただし、\(A \leq B \leq C\) と仮定しても良い)して最小の枚数を求める。
</p>
</div>
</div>

<div id="outline-container-org22db76d" class="outline-2">
<h2 id="org22db76d">No.29</h2>
<div class="outline-text-2" id="text-org22db76d">
<p>
2個あるアイテムを優先で使う。残ったアイテムで4つ組ができればさらに使う。
</p>
</div>
</div>

<div id="outline-container-org29a860c" class="outline-2">
<h2 id="org29a860c">No.30</h2>
<div class="outline-text-2" id="text-org29a860c">
<p>
製品 \(i\) を作るために必要な製品数一覧を返す関数を作り、メモ化再帰する。
</p>
</div>
</div>

<div id="outline-container-orgd74ac6f" class="outline-2">
<h2 id="orgd74ac6f">No.32</h2>
<div class="outline-text-2" id="text-orgd74ac6f">
<p>
小さい金額の硬貨から順番に1つ大きい金額の硬貨に両替していく。
</p>
</div>
</div>

<div id="outline-container-orgf617c96" class="outline-2">
<h2 id="orgf617c96">No.33</h2>
<div class="outline-text-2" id="text-orgf617c96">
<p>
\(X_i\) を \(D\) で割った余りが異なるアメーバ同士は互いに干渉しない。
</p>

<p>
したがって、\(X_i\) を \(D\) で割った余りでグループ分けして、グループごとに計算する。
</p>

<p>
グループ分けされた \(X_i\) は \(D\) で割って座標圧縮しておく。
</p>

<p>
そうすると \(X_k\) の位置にいたアメーバは \(T\) 秒後に \(X_k-T \dots X_k+T\) の範囲に広がる。
</p>

<p>
\(X_i\) ごとにこれを計算し、重なっている範囲を除けばいい。
</p>

<p>
このとき、\(X_i\) を昇順にソートしておくと、重なりのチェックは \(X_{i-1}\) のアメーバだけを対象にすればいい。
</p>
</div>
</div>

<div id="outline-container-orga0f5829" class="outline-2">
<h2 id="orga0f5829">No.34</h2>
<div class="outline-text-2" id="text-orga0f5829">
<p>
幅優先探索と DP を組み合わせる。
</p>

<p>
ある地点 \(p\) までたどり着くまでの最小の体力を \(V(p)\) とする。
</p>

<p>
幅優先探索で、探索元を \(p\) 、探索先を \(q\) とすると、\(V(p)+L(q) \lt V(q)\) のときに探索先は有効となる。
</p>
</div>
</div>

<div id="outline-container-org81defde" class="outline-2">
<h2 id="org81defde">No.35</h2>
<div class="outline-text-2" id="text-org81defde">
<p>
実装あるのみ。
</p>
</div>
</div>

<div id="outline-container-org7c0d990" class="outline-2">
<h2 id="org7c0d990">No.36</h2>
<div class="outline-text-2" id="text-org7c0d990">
<p>
素因数分解したときに素因数(重複を許す)の数が3つ以上あればいい。
</p>
</div>
</div>

<div id="outline-container-orgc9762fa" class="outline-2">
<h2 id="orgc9762fa">No.37</h2>
<div class="outline-text-2" id="text-orgc9762fa">
<p>
\(i\) 番目のアトラクションに2回目以降に乗ったときの満足度を計算し、\(ci, vi\) に追加しておく。
</p>

<p>
このとき、2回目に乗るためには1回目に乗る必要があるといった考慮は必要ない。なぜならば、最大満足度を得るためには2回目に乗るときには1回目はすでに乗っているはずだからである。
</p>

<p>
あとは経過時間 \(t\) のとき、\(i\) 番目のアトラクションまで調べたときの最大満足度を \(V(t,i)\) とすると、
</p>

<p>
\[ V(t,i) = \max(V(t, i - 1), V(t - ci, i - 1) + vi) \]
</p>

<p>
となり、これを DP で計算して、\(V(\ast, (ciの長さ))\) の最大値を計算する。
</p>
</div>
</div>

<div id="outline-container-orgf5e73b1" class="outline-2">
<h2 id="orgf5e73b1">No.38</h2>
<div class="outline-text-2" id="text-orgf5e73b1">
<p>
RとBは合わせて20個なのでどのRとBを使うかで全探索する。
</p>
</div>
</div>

<div id="outline-container-org83ac7ee" class="outline-2">
<h2 id="org83ac7ee">No.39</h2>
<div class="outline-text-2" id="text-org83ac7ee">
<p>
一番上の桁から、その桁より下の桁の数字の最大値を求める。
</p>

<p>
その桁の数字より最大値が大きいならば、その最大値を持つ桁のうち最も下の桁と入れ替えて、答えとなる。
</p>

<p>
そうでないならば次の桁を調べ、以下繰り返す。
</p>
</div>
</div>

<div id="outline-container-orgaf3ea5a" class="outline-2">
<h2 id="orgaf3ea5a">No.40</h2>
<div class="outline-text-2" id="text-orgaf3ea5a">
<p>
実装あるのみ。
</p>
</div>
</div>

<div id="outline-container-org5a85a69" class="outline-2">
<h2 id="org5a85a69">No.41</h2>
<div class="outline-text-2" id="text-org5a85a69">
<p>
\(M\) を111111で割った余りは必ず1円で払わなくてはいけない。
</p>

<p>
\(M\) を111111で割った数(小数点以下切り捨て)を \(N\) とすると、\(N\) 円を1円玉A,1円玉B,2円玉,3円玉, \(\dots\) ,9円玉で支払う方法の組み合わせを求める問題となる。
</p>

<p>
\(n\) 円を \(k\) 円玉以下で支払う方法の組み合わせを \(C(n,k)\) とすると、
</p>

<p>
\[ C(n,k) = C(n,k-1) + C(n-k,k) \]
</p>

<p>
となり、これを DP で計算して \(C(N,9)\) を見る。
</p>
</div>
</div>

<div id="outline-container-org5ed066b" class="outline-2">
<h2 id="org5ed066b">No.43</h2>
<div class="outline-text-2" id="text-org5ed066b">
<p>
行われていないゲームのすべての勝ち負けの組み合わせについて順位を求め、その最小値を求める。
</p>
</div>
</div>

<div id="outline-container-org5bfc2d4" class="outline-2">
<h2 id="org5bfc2d4">No.44</h2>
<div class="outline-text-2" id="text-org5bfc2d4">
<p>
\(i\) マス目にたどり着く組み合わせの数を \(C(i)\) とすると、
</p>

<p>
\[ C(i) = C(i-1) + C(i-2) \]
</p>

<p>
となる。これはフィボナッチ数列である。
</p>
</div>
</div>

<div id="outline-container-orgfa55052" class="outline-2">
<h2 id="orgfa55052">No.45</h2>
<div class="outline-text-2" id="text-orgfa55052">
<p>
\(i\) 番目の寿司まで流れてきたときの最大満足度を \(V(i)\) とすると、
</p>

<p>
\[ V(i) = \max(V(i - 1), V(i - 2) + V_i) \]
</p>

<p>
となり、これを DP で計算して \(V(N)\) を見る。
</p>
</div>
</div>

<div id="outline-container-orga101863" class="outline-2">
<h2 id="orga101863">No.46</h2>
<div class="outline-text-2" id="text-orga101863">
<p>
割り算して小数点以下を切り上げる。
</p>
</div>
</div>

<div id="outline-container-orgff2f11b" class="outline-2">
<h2 id="orgff2f11b">No.47</h2>
<div class="outline-text-2" id="text-orgff2f11b">
<p>
\(N = 2^n\) ならば \(n\) が答えである。
</p>

<p>
\(N = 2^n+k\) ならば、\(n\) 回ポケットを叩いた後、ポケットに \(k\) 枚残してポケットを叩けばいいので、\(n+1\) が答えである。
</p>
</div>
</div>

<div id="outline-container-org505f67e" class="outline-2">
<h2 id="org505f67e">No.48</h2>
<div class="outline-text-2" id="text-org505f67e">
<p>
移動をする操作の回数は割り算(小数点以下切り上げ)で求める。
</p>

<p>
回転をする操作の回数は、\(x \gt 0\) の \(y\) 軸上なら \(0\) 回、\(y \geq 0\) なら \(1\) 回、\(y \lt 0\) なら2回である。
</p>
</div>
</div>

<div id="outline-container-orge5277e4" class="outline-2">
<h2 id="orge5277e4">No.49</h2>
<div class="outline-text-2" id="text-orge5277e4">
<p>
正規表現 <code>([+*]?)(\d+)</code> で走査する。
</p>
</div>
</div>

<div id="outline-container-orge359610" class="outline-2">
<h2 id="orge359610">No.50</h2>
<div class="outline-text-2" id="text-orge359610">
<p>
箱は降順にソートしておく。
</p>

<p>
\(i\) 番目の箱までを使って、\(p\) のおもちゃの集合を入れられるかどうかを \(B(i, p)\) とし、\(q\) のおもちゃの集合を \(i\) 番目の箱に入れられるかどうかを \(C(i, q)\) とすると、
</p>

<p>
\[ B(i + 1, p \cup q) = B(i, p) \lor C(i + 1, q) \]
</p>

<p>
となる。ただし、\(p \cap q = \emptyset\) である。これを DP で計算し、\(B(k, P)\) が真となっている最小の \(k\) を求める。ただし、\(P\) はすべてのおもちゃの集合である。
</p>

<p>
集合をビットで表現すると \(p\) も \(q\) も数字で表せる。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
